app/Controllers/Register.php

    public function index()
    {
        helper(['form']);
        $rules = [
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'confpassword' => 'required|matches[password]',
            'nama' => 'required|alpha_space',
            'no_telepon' => 'required|numeric',
            'kelas' => 'required|alpha_numeric_space',
            'semester' => 'required|numeric',
            'jurusan' => 'required|alpha_numeric_space'
        ];
        if (!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $data = [
            'email' => $this->request->getVar('email'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
            'nama' => $this->request->getVar('nama'),
            'no_telepon' => $this->request->getVar('no_telepon'),
            'kelas' => $this->request->getVar('kelas'),
            'semester' => $this->request->getVar('semester'),
            'jurusan' => $this->request->getVar('jurusan'),
        ];
        $model = new UserModel();
        $model->save($data);
---
INSERT INTO `users` (`email`, `password`, `no_telepon`, `kelas`, `semester`, `jurusan`) VALUES ('riggi@gmail.com', '$2y$10$J1..OiCAhx7Wc0/6NzKk8.K57WKbXagXAyWQjeDuDARVami1ehYIC', '089678244014', '7 AM', '7', 'Teknik Informatika')